# Pandas Data Wrangling Cheat Sheet
## Data Frames
### Create empty dataframe

In [18]:
import pandas as pd

col = ['Hong Kong', 'Kowloon', 'New Territories']
df = pd.DataFrame(columns=col)
df

Empty DataFrame
Columns: [Hong Kong, Kowloon, New Territories]
Index: []

### Add lists

In [19]:
ind=[1990, 2000, 2010]
Data= [['98731','34444','99384'],['34323','44243','88543'],['2222','4324','3432']]
df = pd.DataFrame(Data, columns=col, index=ind)
df

     Hong Kong Kowloon New Territories
1990     98731   34444           99384
2000     34323   44243           88543
2010      2222    4324            3432

### Create dataframe with dictionaries

In [20]:
Data= {'A':[98731, 34444,99384],'B':[34323,44243,88543],'C': [2222,4324,None]}
df = pd.DataFrame(Data)
df

       A      B       C
0  98731  34323  2222.0
1  34444  44243  4324.0
2  99384  88543     NaN

## Columns
### Rename a Column

In [21]:
df = df.rename(columns={"A":"tokyo"})
df

   tokyo      B       C
0  98731  34323  2222.0
1  34444  44243  4324.0
2  99384  88543     NaN

### Insert a Column

In [22]:
d = ["x", "y", "z"]
df["D"] = d
df

   tokyo      B       C  D
0  98731  34323  2222.0  x
1  34444  44243  4324.0  y
2  99384  88543     NaN  z

### Drop a Column

In [23]:
df.drop("C", axis=1)

   tokyo      B  D
0  98731  34323  x
1  34444  44243  y
2  99384  88543  z

### Add A Row

In [24]:
new_row = {"A":98989, "B":77889, "C":None, "D":"z"}
df = df.append(new_row, ignore_index=True)
df

     tokyo      B       C  D        A
0  98731.0  34323  2222.0  x      NaN
1  34444.0  44243  4324.0  y      NaN
2  99384.0  88543     NaN  z      NaN
3      NaN  77889     NaN  z  98989.0

### Drop a Row

In [25]:
df.drop(0)

     tokyo      B       C  D        A
1  34444.0  44243  4324.0  y      NaN
2  99384.0  88543     NaN  z      NaN
3      NaN  77889     NaN  z  98989.0

### Drop Duplicates

In [26]:
## we don't have any, but here is how to . . . 
df.drop_duplicates()

     tokyo      B       C  D        A
0  98731.0  34323  2222.0  x      NaN
1  34444.0  44243  4324.0  y      NaN
2  99384.0  88543     NaN  z      NaN
3      NaN  77889     NaN  z  98989.0

## Null Values
### Check out null values

In [27]:
pd.isnull(df)

   tokyo      B      C      D      A
0  False  False  False  False   True
1  False  False  False  False   True
2  False  False   True  False   True
3   True  False   True  False  False

### Locate null value horizontally

In [28]:
pd.isnull(df).any(axis=0)

tokyo     True
B        False
C         True
D        False
A         True
dtype: bool

Fill all the NaN with some meaningful values

In [29]:
df2 = df.copy()
df3 = df2.fillna(0) # fill with 0
df4 = df2.fillna(df.mean()) # fill with the mean of the column
df5 = df2.fillna(df.B.max()) # fill with the max of column B

In [31]:
df3

     tokyo      B       C  D        A
0  98731.0  34323  2222.0  x      0.0
1  34444.0  44243  4324.0  y      0.0
2  99384.0  88543     0.0  z      0.0
3      0.0  77889     0.0  z  98989.0